**`nomis-development`** terraform plan on `pull_request` event [#3353](https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4260846687)

```
Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.cert_expires_in_2_days must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_2_days" {
      ~ alarm_name                            = "cert_expires_in_2_days" -> "cert-expires-in-2-days" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:cert_expires_in_2_days" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "cert_expires_in_2_days" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.cert_expires_in_30_days must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "cert_expires_in_30_days" {
      ~ alarm_name                            = "cert_expires_in_30_days" -> "cert-expires-in-30-days" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:cert_expires_in_30_days" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "cert_expires_in_30_days" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_dns must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_dns" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_dns" -> "load-balancer-unhealthy-state-dns" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:load_balancer_unhealthy_state_dns" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_dns" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_routing must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_routing" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_routing" -> "load-balancer-unhealthy-state-routing" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:load_balancer_unhealthy_state_routing" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_routing" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.load_balancer_unhealthy_state_target must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "load_balancer_unhealthy_state_target" {
      ~ alarm_name                            = "load_balancer_unhealthy_state_target" -> "load-balancer-unhealthy-state-target" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:load_balancer_unhealthy_state_target" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "load_balancer_unhealthy_state_target" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["disk-free-windows"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:327850556621:nomis_alarms",
        ]
      + alarm_description                     = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space falls below 15% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4305453159/Disk+Free+alarm+-+Windows"
      + alarm_name                            = "jumpserver-2022-disk-free-windows"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "AutoScalingGroupName" = "jumpserver-2022"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DISK_FREE"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 15
      + treat_missing_data                    = "missing"
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["disk_free_windows"] will be destroyed
  # (because key ["disk_free_windows"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:327850556621:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space falls below 15% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4305453159/Disk+Free+alarm+-+Windows" -> null
      - alarm_name                = "disk_free_windows" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:disk_free_windows" -> null
      - comparison_operator       = "LessThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {
          - "AutoScalingGroupName" = "jumpserver-2022"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "disk_free_windows" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "DISK_FREE" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 15 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["high-cpu-windows"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:327850556621:nomis_alarms",
        ]
      + alarm_description                     = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space falls below 15% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4305453159/Disk+Free+alarm+-+Windows"
      + alarm_name                            = "jumpserver-2022-high-cpu-windows"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "AutoScalingGroupName" = "jumpserver-2022"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "PROCESSOR_TIME"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 95
      + treat_missing_data                    = "missing"
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["high_cpu_windows"] will be destroyed
  # (because key ["high_cpu_windows"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:327850556621:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of free disk space on the instance. If the amount of free disk space falls below 15% for 2 minutes, the alarm will trigger: https://dsdmoj.atlassian.net/wiki/spaces/DSTT/pages/4305453159/Disk+Free+alarm+-+Windows" -> null
      - alarm_name                = "high_cpu_windows" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:high_cpu_windows" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 5 -> null
      - dimensions                = {
          - "AutoScalingGroupName" = "jumpserver-2022"
        } -> null
      - evaluation_periods        = 5 -> null
      - id                        = "high_cpu_windows" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "PROCESSOR_TIME" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 95 -> null
      - treat_missing_data        = "missing" -> null
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["low-available-memory-windows"] will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:327850556621:nomis_alarms",
        ]
      + alarm_description                     = "This metric monitors the amount of available memory. If Committed Bytes in Use is > 80% for 2 minutes, the alarm will trigger."
      + alarm_name                            = "jumpserver-2022-low-available-memory-windows"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "AutoScalingGroupName" = "jumpserver-2022"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "Memory % Committed Bytes In Use"
      + namespace                             = "CWAgent"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.ec2_jumpserver["jumpserver-2022"].aws_cloudwatch_metric_alarm.this["low_available_memory_windows"] will be destroyed
  # (because key ["low_available_memory_windows"] is not in for_each map)
  - resource "aws_cloudwatch_metric_alarm" "this" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:eu-west-2:327850556621:nomis_alarms",
        ] -> null
      - alarm_description         = "This metric monitors the amount of available memory. If Committed Bytes in Use is > 80% for 2 minutes, the alarm will trigger." -> null
      - alarm_name                = "low_available_memory_windows" -> null
      - arn                       = "arn:aws:cloudwatch:eu-west-2:327850556621:alarm:low_available_memory_windows" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 2 -> null
      - dimensions                = {
          - "AutoScalingGroupName" = "jumpserver-2022"
        } -> null
      - evaluation_periods        = 2 -> null
      - id                        = "low_available_memory_windows" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "Memory % Committed Bytes In Use" -> null
      - namespace                 = "CWAgent" -> null
      - ok_actions                = [] -> null
      - period                    = 60 -> null
      - statistic                 = "Average" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 80 -> null
      - treat_missing_data        = "missing" -> null
    }

Plan: 8 to add, 0 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
